<?php if (!defined('BASEPATH')) exit('No direct script access allowed');

$config['required_subjects'] = array(
    'математика' => array('математика', 'матем', 'матем.', 'мат-ка', 'математека'),
    'русский язык'  => array('русский язык', 'русс. яз.', 'русск. яз.', 'рус.яз.',
        'рус.', 'русский', 'рус. яз.', 'русский яз.', 'рус. язык', 'русс. язык', 'русск. язык'),
    'английский язык' => array('английский язык', 'англ.яз.', 'англ. яз.',
        'англ.', 'английский', 'англ. яз.', 'английский яз.', 'англ. язык'),
    'биология' => array('биология', 'биолог.'),
    'география' => array('география', 'географ.'),
    //'история'
);
$config['max_subjects'] = 5;
$config['histogramm_grades'] = 7; // Максимальное количество оценок при котором используется гистограмма