<?php if (!defined('BASEPATH')) exit('No direct script access allowed');

$config['required_subjects'] = array(
    /*
    'алгебра' => array('алгебра'),
    'геометрия' => array('геометрия', 'геом.', 'геометр.'),
    'химия' => array('химия'),
     * 
     */
    'алгебра' => array('алгебра', 'алгебр.', 'алгебр', 'алг.', 'алг', 'алгеб.', 'алгеб'),
    'геометрия' => array('геометрия', 'геометр', 'геом', 'геом.', 'геометр.', 'г-метрия'),
    'математика' => array('математика', 'матем', 'матем.', 'мат-ка', 'математека', 'матем-ка'),
    'физика' => array ('физика', 'физ.', 'физ', 'физик', 'физик.'),
    'русский язык'  => array('русский язык', 'русс. яз.', 'русск. яз.', 'рус.яз.',
       'рус.', 'русский', 'рус. яз.', 'русский яз.', 'рус. язык', 'русс. язык', 'русск. язык',
       'рус.яз', 'рус яз'),
    'английский язык' => array('английский язык', 'англ.яз.', 'англ. яз.',
       'англ.', 'англ', 'английский', 'англ. яз.', 'английский яз.', 'англ. язык', 'англ.яз', 'англ яз'),
    'история' => array('история', 'истор.','истор'),
    'биология' => array('биология', 'биолог.', 'биолог', 'биол', 'биол.'),
    'природоведение' => array ('природоведение', 'природ.', 'природ', 'природовед.', 'природовед' ),
    'чтение' => array ('чтение', 'чтен.', 'чтен' ),
    'химия' => array ('химия', 'хим.', 'хим' ),
    'литература' => array ('литература', 'лит-ра','литер.', 'литер.', 'литератур.'),
   'география' => array('география', 'географ.', 'геогр.', 'геогр')
);
$config['max_subjects'] = 6;      // Отчет должен содержать не более .. предметов
$config['histogramm_grades'] = 7; // Максимальное количество оценок при котором используется гистограмма